---
kind: other
id: Methods.T:Autodesk.Revit.DB.UpdaterRegistry
source: html/ac2e0caf-912f-a7f1-2347-d3bc271fa70e.htm
---
# UpdaterRegistry Methods

Adds trigger with the specified element filter and ChangeType for all documents associated with this Updater